
#include <time.h>
#include <conio.h>
#include <iostream>
#include <string>
#include "docs.h"


using namespace std;

public:

int weather_list[30][5] = {
    { 0 , 2 , 0 , 1 , 0 } ,{ 1 , 1 , 1 , 0 , 0 } ,{ 2 , 2 , 0 , 1 , 0 } ,{ 0 , 1 , 0 , 0 , 1 } ,{ 1 , 3 , 1 , 0 , 0 } ,
    { 0 , 2 , 0 , 1 , 1 } ,{ 1 , 2 , 1 , 0 , 2 } ,{ 0 , 2 , 0 , 1 , 0 } ,{ 3 , 1 , 1 , 0 , 1 } ,{ 2 , 1 , 0 , 0 , 0 } ,
    { 0 , 0 , 0 , 0 , 0 } ,{ 2 , 1 , 1 , 0 , 0 } ,{ 0 , 1 , 2 , 3 , 0 } ,{ 0 , 1 , 2 , 3 , 0 } ,{ 0 , 1 , 2 , 3 , 0 } ,
    { 0 , 1 , 2 , 3 , 0 } ,{ 0 , 1 , 2 , 3 , 0 } ,{ 0 , 1 , 2 , 3 , 0 } ,{ 0 , 1 , 2 , 3 , 0 } ,{ 0 , 1 , 2 , 3 , 0 } ,
    { 0 , 1 , 2 , 3 , 0 } ,{ 0 , 1 , 2 , 3 , 0 } ,{ 0 , 1 , 2 , 3 , 0 } ,{ 0 , 1 , 2 , 3 , 0 } ,{ 0 , 1 , 2 , 3 , 0 } ,
    { 0 , 1 , 2 , 3 , 0 } ,{ 0 , 1 , 2 , 3 , 0 } ,{ 0 , 1 , 2 , 3 , 0 } ,{ 0 , 1 , 2 , 3 , 0 } ,{ 0 , 1 , 2 , 3 , 0 }
};

string MAP[25][10] = {
    {"W"  ,"S05","S06","S07","S09","L01","S12","L02","S11","S08"},
    {"M"  ,"S01","S04","S05"},
    {"D"  ,"S15","S12","S13"},

    {"S01","M"  ,"S05","S06","S02"},
    {"S02","S01","S06","S07","C01"},
    {"S03","C01","S07","S10"},
    {"S04","M"  ,"S05","C02"},
    {"S05","M"  ,"S01","S06","W"  ,"S08","C02","S04"},
    {"S06","S01","S02","S07","W"  ,"S05"},
    {"S07","S02","C01","S03","S10","S09","W"  ,"S06"},
    {"S08","C02","S05","W"  ,"S11"},
    {"S09","W"  ,"S07","S10","L01","S12","S13"},
    {"S10","S07","S03","S13","S09"},
    {"S11","S08","C03","S14","C04","S15","S12","L02","W"},
    {"S12","W"  ,"L01","S09","S13","D"  ,"S15","S11","L02"},
    {"S13","S09","S10","D"  ,"S12"},
    {"S14","C03","S11","C04"},
    {"S15","C04","C05","S11","D"  ,"S12"},

    {"C01","S02","S07","S03"},
    {"C02","S04","S05","S08","C03"},
    {"C03","C02","S11","S14"},
    {"C04","S14","S11","S15"},
    {"C05","S15"},

    {"L01","W"  ,"S09","S12"},
    {"L02","S11","W"  ,"S12"},
};

struct GROUP {
    int ID = 0;                // 队名
    int alive = 1;             // 是否存活
    int miss = 0;              // 是否迷路
    int back = 0;              // 是否回到大本营
    int rank = -1;             // 排名
    int integral = 1000;       // 积分
    int alive_day = 0;         // 存活天数
    int money = 1000;          // 剩余的金钱
    int residual_load = 1000;  // 剩余的磅重
    int water = 1;          // 水
    int food = 1;           // 食物
    int tent = 1;           // 帐篷
    int compass = 1;        // 指南针
    string locations = "D";    // 位置
    int gold = 0;              // 黄金
    int card = -1;             // 抽取卡牌编号
    int W_card = -1;             // 王陵抽取卡牌编号
    int C_card = -1;             // 村庄抽取卡牌编号
    int L_card = -1;             // 绿洲抽取卡牌编号
    string Bei_zhu = " ";      // 备注
};


GROUP group[100];            // 预设100个队伍
int ALL_DAY = 15;         // 游戏天数
char confirm;           // 接受确认回参
int group_num = 0;       // 队伍数量
int game_day = 0;        // 游戏日期
int game_ranking = 0;    // 排名
int back_day = 0;        // 上一队到达日期